OpenFOAM/run/prescribedU/sShapedFlow/baseCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	location		"system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFlow;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         6;

writeControl    adjustableRunTime;

writeInterval   .05;

deltaT          0.002;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           1e10;
maxAlphaCo      0.2;

maxDeltaT       0.2;

libs ( "libVOFInterpolationSchemes.so" );

// ************************************************************************* //
